{
  "title": {
    "entryKind": "plain",
    "content": "Убегающая кнопка"
  },

  "text": {
    "entryKind": "rich",
    "content": [
      "# Убегающая кнопка",
      "",
      "Кнопка, которая пытается убежать от указателя мышки. Очевидно, поддерживается только ввод с помощью мышки.",
      "",
      "Разработано в 2020, с полным перенаписанием в 2025.",
      "",
      "Код можно найти [в GitHub](${githubPageUrl}).",
      "",
      "## Метод",
      "",
      "Кнопка попросту мчится к самому ближнему допустимому аттрактору на равномерной квадратной решётке.",
      "Является ли аттрактор допустимым зависит от его расстояние от указателя мышки.",
      "Это можно визуализировать используя режима отладки.",
      "",
      "Скорость движения зависит от скорости указателя мышки, с двойными и тройными ускорениями если указатель находится слишком близко",
      "",
      "С текущим подходом есть рабочая стратегия по поимке кнопки, но её довольно трудно использовать.",
      "Во время разработки я попробовал более аккуратные подходы, но все они были более уязвимые.",
      "",
      "* Изначально я просто отодвигал кнопку от указателя мышки и отражал её от граней.",
      "Это фундаментальным образом зависело от угла и расстояния отражения, что позволяло легко нажать на кнопку на маленьких экранах",
      "",
      "* Во время переработки, я придумал алгоритм использующий точки отталкивания.",
      "Эти точки находились на месте указателя мышки и проекций центра кнопки на грани.",
      "Каждая точка отталкивания имела \"размах\", который определял какие направления движения являются запрещёнными.",
      "",
      "  Если несколько точек отталкивания находились на критическом расстоянии от кнопки, я пробовал вычислить безопасное направление, которое не попадало в размах ни одной из точек.",
      "Это работало довольно хорошо в середине граней, где было две точки отталкивания, но проваливалось в углах, где таких точек было три.",
      "",
      "* На первый взгляд более простой подход предполагал только один аттрактор в центре.",
      "Кнопка мчалась к точке близкой к центру, которая всё же на безопасном расстоянии от указателя мышки",
      "",
      "  Это было неудовлетворительно, поскольку все зависимости от алгоритма используемого для уклонения от указателя, всегда находилась возможность угнать кнопку, если внимательно двигать указатель и \"обманывать\" алгоритм."
    ]
  },

  "control.debug": {
    "entryKind": "plain",
    "content": "Режим отладки"
  },

  "control.reset": {
    "entryKind": "plain",
    "content": "Сбросить"
  },

  "message.click.mouse": {
    "entryKind": "plain",
    "content": "Вы выиграли!"
  },

  "message.click.touch": {
    "entryKind": "plain",
    "content": "Использовать сенсорный экран нечестно. Попытайтесь гнаться за кнопкой с помощью мышки."
  },

  "message.click.pen": {
    "entryKind": "plain",
    "content": "Использовать ручку нечестно. Попытайтесь гнаться за кнопкой с помощью мышки."
  }
}
